# Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
data_ratings = pd.read_csv('ratings.csv')

In [4]:
data_ratings.head(5)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [56]:
# Фильтруем фильмы только с оценками 5.0
data_ratings[data_ratings.rating == 5.0].head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [26]:
# Находим id фильма с максимальным количеством наивысших оценок
top = data_ratings['movieId'].value_counts().head(1)

In [28]:
print(f'Фильм с наибольшим количеством оценок 5.0 имеет ID {top.index[0]}')

Фильм с наибольшим количеством оценок 5.0 имеет ID 356

In [14]:
# Для определения названия фильма по ID загружаем файл movies
data_movie = pd.read_csv('movies.csv')

In [15]:
data_movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [57]:
# Определяем название фильма
data_movie[data_movie.movieId == top.index[0]]["title"]

314    Forrest Gump (1994)
Name: title, dtype: object

**Вопрос: Подскажите,пожалуйста, как вывести название фильма без сопутствующих данных. Только Forrest Gump (1994)**

# Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [58]:
data = pd.read_csv('power.csv')

In [59]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [60]:
# Опреляем используемый вариант названия стран Прибалтики: Латвия, Литва, Эстония
data[ data['country'].str.contains('lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [61]:
data[ data['country'].str.contains('lit', case=False) ]['country'].unique()

array(['Lithuania'], dtype=object)

In [63]:
data[ data['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [68]:
# Фильтр по странам
filter_countries = data[(data.country == 'Latvia')| (data.country == 'Lithuania') | (data.country == 'Estonia')]

In [71]:
# Фильтр по категориям
filter_category = filter_countries[(filter_countries.category == 4)|(filter_countries.category == 12)|(filter_countries.category == 21)]

In [74]:
# Фильтр по годам
filter_year = filter_category[(filter_category.year >= 2005) & (filter_category.year <= 2010)]

In [78]:
# Фильтр по количеству
filter_quantity = filter_year[filter_year.quantity >= 0]

In [83]:
# Итоговый результат
result = filter_quantity['quantity'].sum()
print(f'Суммарное потребление стран Прибалтики {result}')

Суммарное потребление стран Прибалтики 240580.0

In [81]:
# Вариант 2 - все фильтры объединить вместе
data_result = data.query(f"country in ['Latvia','Lithuania','Estonia'] & category in [4,12,21] & 2005 <= year <= 2010 & quantity >=0")

In [86]:
result = data_result['quantity'].sum()
print(f'Суммарное потребление стран Прибалтики {result}')

Суммарное потребление стран Прибалтики 240580.0

# Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [109]:
url = "https://www.cbr.ru/hd_base/metall/metall_base_new/"
metall = pd.read_html(url)[0]

In [110]:
metall

        Дата*      Золото  Серебро     Платина    Палладий
0  14.11.2020  4 669,3800   602000  2 212,6200  5 842,3200
1  13.11.2020  4 631,3300   600200  2 164,4300  5 838,7400
2  12.11.2020  4 596,9300   592800  2 173,2600  6 039,5600
3  11.11.2020  4 605,2100   616600  2 149,2100  6 098,8600
4  10.11.2020  4 842,8200   637800  2 236,5400  6 044,1000
5  07.11.2020  4 834,1000   609700  2 235,9500  5 933,5900
6  06.11.2020  4 834,9600   604700  2 239,9000  5 902,4500
7  04.11.2020  4 886,5600   616700  2 242,8500  5 789,7500